In [1]:
import pandas as pd
import numpy as np

In [3]:
fortune = pd.read_csv("C:\ML\data\Fortune_500_2017.csv", usecols = ['Rank','Title','Employees','Profits','Assets'], index_col=['Rank'])

In [4]:
fortune.head()

                   Title  Employees  Profits  Assets
Rank
1                Walmart    2300000  13643.0  198825
2     Berkshire Hathaway     367700  24074.0  620854
3                  Apple     116000  45687.0  321686
4            Exxon Mobil      72700   7840.0  330314
5               McKesson      68000   2258.0   56563

In [6]:
fortune["Employees"].rank(ascending = False).head()

Rank
1      1.0
2      7.0
3     57.0
4     94.0
5    104.5
Name: Employees, dtype: float64

In [7]:
fortune["RankByEmp"] = fortune["Employees"].rank(ascending = False).head()

In [8]:
fortune

                   Title  Employees  Profits  Assets  RankByEmp
Rank
1                Walmart    2300000  13643.0  198825        1.0
2     Berkshire Hathaway     367700  24074.0  620854        7.0
3                  Apple     116000  45687.0  321686       57.0
4            Exxon Mobil      72700   7840.0  330314       94.0
5               McKesson      68000   2258.0   56563      104.5
...                  ...        ...      ...     ...        ...
496        Michaels Cos.      31000    378.2    2148        NaN
497        Toll Brothers       4200    382.1    9737        NaN
498                Yahoo       8500   -214.3   48083        NaN
499        Vistra Energy       4431   -214.3   15167        NaN
500       ABM Industries     110000     57.2    2281        NaN

[500 rows x 5 columns]

In [32]:
prof = fortune["Profits"].rank(ascending = False).head()

In [35]:
fortune['prof'] = fortune["Profits"].rank(ascending = False).head()

In [29]:
Emprank = fortune.RankByEmp <= 10

In [30]:
Emprank.value_counts()

False    498
True       2
Name: RankByEmp, dtype: int64

In [36]:
Profrank = fortune.prof <=10

In [37]:
Profrank

Rank
1      False
2       True
3       True
4      False
5      False
       ...
496    False
497    False
498    False
499    False
500    False
Name: prof, Length: 500, dtype: bool

In [43]:
fortune[Emprank & prof<10]

                   Title  Employees  Profits  Assets  RankByEmp   prof
Rank
1                Walmart    2300000  13643.0  198825        1.0   11.0
2     Berkshire Hathaway     367700  24074.0  620854        7.0    3.0
3                  Apple     116000  45687.0  321686       57.0    1.0
4            Exxon Mobil      72700   7840.0  330314       94.0   27.0
5               McKesson      68000   2258.0   56563      104.5  102.0
...                  ...        ...      ...     ...        ...    ...
496        Michaels Cos.      31000    378.2    2148        NaN    NaN
497        Toll Brothers       4200    382.1    9737        NaN    NaN
498                Yahoo       8500   -214.3   48083        NaN    NaN
499        Vistra Energy       4431   -214.3   15167        NaN    NaN
500       ABM Industries     110000     57.2    2281        NaN    NaN

[500 rows x 6 columns]

In [39]:
emp400 = fortune.RankByEmp >=400

In [44]:

fortune [emp400 & Profrank]

Empty DataFrame
Columns: [Title, Employees, Profits, Assets, RankByEmp, prof]
Index: []

emp400

In [47]:
emp400.value_counts()

False    500
Name: RankByEmp, dtype: int64

In [49]:
fortune['RankingPracownicy'] = fortune['Employees'].rank(ascending = False)

In [55]:
fortune['RankingProfity'] = fortune['Profits'].rank(ascending = False)

In [57]:
rpow400 = fortune.RankingPracownicy >=400

In [58]:
rfor10 = fortune.RankingProfity <=10

In [59]:
fortune [rpow400 & rfor10]

,Title,Employees,Profits,Assets,RankByEmp,prof,RankingPracownicy,RankingProfity
Rank,,,,,,,,
148,Altria Group,8300,14239.0,45932,NaN,NaN,424.0,10.0